system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Include defaults parameters from master dictionary
#includeEtc "caseDicts/meshQualityDict"


minFaceWeight 0.02;
maxNonOrtho 85;
maxBoundarySkewness 4;
maxInternalSkewness 4;
maxConcave 70;
minVol 1e-15;
minTetQuality 1e-10;
minArea 1e-15;
minTwist 0.0002;
minDeterminant 0.0001;
minFaceWeight 0.0005;
minVolRatio 0.01;


// ************************************************************************* //
